import {useState} from 'react';

const MoveRegionChange = () => {

    const regionMap = {
        "101" : "강남구",
        "102" : "강동구",
        "103" : "강북구",
        "104" : "강서구",
        "105" : "관악구",
        "106" : "광진구",
        "107" : "구로구",
        "108" : "금천구",
        "109" : "노원구",
        "110" : "도봉구",
        "111" : "동대문구",
        "112" : "동작구",
        "113" : "마포구",
        "114" : "서대문구",
        "115" : "서초구",
        "116" : "성동구",
        "117" : "성북구",
        "118" : "송파구",
        "119" : "양천구",
        "120" : "영등포구",
        "121" : "용산구",
        "122" : "은평구",
        "123" : "종로구",
        "124" : "중구",
        "125" : "중랑구",
        "201" : "가평",
        "202" : "고양",
        "203" : "과천",
        "204" : "광명",
        "205" : "광주",
        "206" : "구리",
        "207" : "군포",
        "208" : "김포",
        "209" : "남양주",
        "210" : "동두천",
        "211" : "부천",
        "212" : "성남",
        "213" : "수원",
        "214" : "시흥",
        "215" : "안산",
        "216" : "안성",
        "217" : "안양",
        "218" : "양주",
        "219" : "양평",
        "220" : "여주",
        "221" : "연천",
        "222" : "오산",
        "223" : "용인",
        "224" : "의왕",
        "225" : "의정부",
        "226" : "이천",
        "227" : "파주",
        "228" : "평택",
        "229" : "포천",
        "230" : "하남",
        "231" : "화성",
        "30" : "인천",
        default : "error"
    };

    const getMoveRegion = (moveRegion) => {
        return regionMap[moveRegion] || regionMap.default;
    };

    return {getMoveRegion};
};

export default MoveRegionChange;